from unittest import result


text = "¹Сёпшо.Пьп.Шротюоѐыљу.жѐоыљÉ:.ѐошфу.цхруяѐыљч.шош.¹Яэоыѕ.Пьп.Яшрћю.ЭћыѐяÉ.6оысщ<.a~}|usP}p.aos^o|7:.•.оъуюцшоыяшцч.ъёщњѐцэщцшоєцьыыљч.яуюцощ:.шьѐьюљч.ѐюоыящцюёуѐяѝ.ыо.ѐущушоыощу.¹\wqysz}rs}|É<.Эьѝрцщяѝ.р.ћђцюу.?.ъоѝ.?GGG.сьто.ц.яѐощ.ьтыьч.цх.яоъљѓ.эьэёщѝюыљѓ.оыцъоєцьыыљѓ.эюьсюоъъ.ѐущурцтуыцѝ<.лѐь.эуюрљч.эь.эюьтьщфцѐущњыьяѐц.эьшохо.оыцъцюьроыыљч.яуюцощ.ѐущушоыощо.¹\wqysz}rs}|É:.ьпьсыоріцч.¹Ьѓ.ёф.ћѐц.туѐшц/É.•.ыо.тоыыљч.ъьъуыѐ.ьы.ыояѕцѐљроуѐ.?@.эьщыљѓ.яухьыьр<.Р.цќщу.@>?G.сьто.ъёщњѐяуюцощ.пљщ.эюьтщџы.ыо.ѐюцыотєоѐљч.яухьы<.Тучяѐрцѝ.оыцъоєцьыыьсь.яуюцощо.юохрьюоѕцроќѐяѝ.ыо.тыу.ацѓьсь.ьшуоыо:.р.ыупьщњіьъ.рљъљіщуыыьъ.сьюьтшу.эьт.ыохроыцуъ.Пцшцыц.Пьѐѐьъ:.сту.сщорыљъц.тучяѐрёќїцъц.щцєоъц.ѝрщѝќѐяѝ.эюутяѐорцѐущц.ъьюяшьч.ђоёыљ<.Ярѝхоыь.ћѐь.я.ѐуъ:.ѕѐь.яьхтоѐущњ.яуюцощо.Яѐцруы.гцщщуыпуюс.ыоѕощ.яьхтороѐњ.ъёщњѐђцщњъљ.ц.юцяёышц.ыо.ѐуъё.фцхыц.ьпцѐоѐущуч.ъьюяшьсь.тыо:.уїџ.шьсто.эюуэьторощ.ъьюяшёќ.пцьщьсцќ.р.Цыяѐцѐёѐу.ьшуоыьщьсцц.ьшюёсо.Ьюцытф.р.Тоыо;Эьчыѐ:.іѐоѐ.Шощцђьюыцѝ:.я.?GFB.эь.?GFE.сьт<.Р.?GFE.сьтё.гцщщуыпуюс.ьяѐорцщ.цыяѐцѐёѐ:.ѕѐьпљ.юуощцхьроѐњ.ярьќ.ъуѕѐё.•.яѐоѐњ.ъёщњѐцэщцшоѐьюьъ<"

alphabet = ""

            
for x in text:
    if (x in alphabet) == False:
        alphabet += x
print(alphabet)

for x in alphabet:
    how_many = text.count(x)
    print(x, how_many)
    
key = 14

result= ''

for x in text:
    number = ord(x)
    number -= key
    new = chr(number)
    
    result += new
    
print(result)